Revit 2026 API

# SketchSketchPlane Property

---

Returns the Sketch Plane of the Sketch.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SketchPlane SketchPlane { get; }
```
```vb
Public ReadOnly Property SketchPlane As SketchPlane
	Get
```
```cpp
public:
property SketchPlane^ SketchPlane {
	SketchPlane^ get ();
}
```
```fsharp
member SketchPlane : SketchPlane with get
```

#### Property Value

SketchPlane

This property is used to retrieve the Sketch Plane of Sketch.

#### Reference

Sketch Class

Autodesk.Revit.DB Namespace